woutkolkman/legionella_predictor/stm32f0/projects/stm32f0/src/green_led.c
#include "green_led.h"
#include "stm32f0xx_gpio.h"
#include <stdint.h>

// private defines
void Green_led_on(void);
void Green_led_off(void);
float difference(uint8_t a, uint8_t b);

// setup the green led
void Green_led_init(void) {
	// ----- init the green led
	// green led on gpio port PC9
	// GPIOC Periph clock enable
	RCC->AHBENR |= RCC_AHBENR_GPIOCEN; 
	
	// set PC9 as output (green led)
  GPIOC->MODER |= GPIO_MODER_MODER9_0;
  // Push pull mode selected
  GPIOC->OTYPER &= ~GPIO_OTYPER_OT_9;
  
	// Maximum speed setting (even though it is unnecessary)
  GPIOC->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9;
	
  // Pull-up and pull-down resistors disabled
  GPIOC->PUPDR &= ~GPIO_PUPDR_PUPDR9;
}

// turn green led on
void Green_led_on(void) {
	// set green led high
	GPIOC->BSRR = GPIO_BSRR_BS_9;
}

// turn green led off
void Green_led_off(void) {
	// set green led low
	GPIOC->BSRR = GPIO_BSRR_BR_9;
}


// calcualte te difference of two numbers
float difference(uint8_t a, uint8_t b) {
	if(a < b) {
		return b-a;
	}
	else {
		return a-b;
	}
}

// set green led on when temprature drops, else set green led off
void Green_led_update(uint8_t temp) {
 static float previous_temp;
 static int8_t delay = 0;
	// determine when a whassing happens
	if( difference(previous_temp, temp) >= TEMP_TRESHOLD && previous_temp > temp) {
		// when wassing happens, turn green led on
		Green_led_on();
	}
	else {
		// else if met delay turn green led off
		delay++;
		if(delay > DELAY_GREEN_TURNOFF) { 
			// turn green led off
			Green_led_off();
			delay = 0;
		}
	}
	
  // update previous_temp
  previous_temp = temp;	
}
